---
type: TopRailType
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 1
tags: [revit-api, class]
---

# TopRailType

`Autodesk.Revit.DB.Architecture.TopRailType` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Parameter | — | `` |